config/cf/InformationRegisters/СозданныеОбъектыНаОснованииВходящихПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>СозданныеОбъектыНаОснованииВходящихПисем</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗаписьЭлектроннойПочты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

config/cf/InformationRegisters/СозданныеОбъектыНаОснованииВходящихПисем/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьСозданныйОбъект(Знач УчетнаяЗаписьЭлектроннойПочты, Знач ИдентификаторСообщения, Знач ДатаСоздания) Экспорт
	
	МенеджерЗаписи									= РегистрыСведений.СозданныеОбъектыНаОснованииВходящихПисем.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.УчетнаяЗаписьЭлектроннойПочты 	= УчетнаяЗаписьЭлектроннойПочты;
	МенеджерЗаписи.ИдентификаторСообщения 			= ИдентификаторСообщения;
	МенеджерЗаписи.ДатаСоздания 					= ДатаСоздания;
	МенеджерЗаписи.Записать();		
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
